'''
【問題概要】
500 円玉を A 枚、100 円玉を B 枚、50 円玉を C 枚持っています。これらの硬貨の中から何枚かを選び、合計金額をちょうど X 円にする方法は何通りあるでしょうか？

【制約】

0≤A,B,C≤50
A+B+C≥1
50≤X≤20000
A,B,C は整数である
X は 50 の倍数である
【数値例】
1)
　A=2
　B=2
　C=2
　X=100
　答え: 2
条件を満たす選び方は以下の 2 通りです。

500 円玉を 0 枚、100 円玉を 1 枚、50 円玉を 0 枚選ぶ
500 円玉を 0 枚、100 円玉を 0 枚、50 円玉を 2 枚選ぶ

【キーポイント】

for 文を用いた全探索
二重三重の for 文
'''


def main2021_02_02(a, b):



#  if __name__ == '__main__': の分の中の処理は python3 sorts.py とコマンドで呼び出した時に自動的に呼ばれる
if __name__ == '__main__':
  s = main2021_02_02(3, 4)
  print(s)